TexasInstruments/c2000ware-core-sdk/libraries/communications/PMBus/c28/examples/common/f2838x/pmbus_target.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2838x" --package "337bga" --part "F2838x_337bga" --product "C2000WARE@3.01.00.00"
 * @versions {"tool":"1.10.0+2163"}
 */

/**
 * Import the modules used in this configuration.
 */
const device_support = scripting.addModule("/driverlib/device_support.js");
const pmbus  = scripting.addModule("/driverlib/pmbus.js", {}, false);
const pmbus1 = pmbus.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
pmbus1.$name                        = "myPMBUS0";
pmbus1.BaudRate                     = 10000000;
pmbus1.mode                         = "Target";
pmbus1.OwnAddress                   = 0x6A;
pmbus1.TargetAddress                = 0x1A;
pmbus1.enablePMBus                  = true;
pmbus1.useInterrupts                = true;
pmbus1.registerInterrupts           = true;
pmbus1.enabledInterrupts            = ["PMBUS_INT_DATA_READY","PMBUS_INT_DATA_REQUEST","PMBUS_INT_EOM"];
pmbus1.pmbus.$assign                = "PMBUSA";
pmbus1.pmbus.pmbus_alertPin.$assign = "ball.K1";
pmbus1.pmbus.pmbus_ctlPin.$assign   = "ball.L1";
pmbus1.pmbus.pmbus_sclPin.$assign   = "ball.K3";
pmbus1.pmbus.pmbus_sdaPin.$assign   = "ball.K2";
pmbus1.PMBusInt.enableInterrupt     = true;
pmbus1.PMBusInt.interruptHandler    = "pmbusIntHandler";
